Applying:

```
grafana_folder.Staging: Refreshing state... [id=31]
grafana_folder.Production: Refreshing state... [id=32]
grafana_folder.Dev: Refreshing state... [id=30]
grafana_dashboard.dev["dev.json"]: Refreshing state... [id=9uim8cafdujnk]
grafana_dashboard.staging["stag.json"]: Refreshing state... [id=9uibklgm8cunk]
grafana_dashboard.production["prod.json"]: Refreshing state... [id=9uim8cunk]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # grafana_folder.Dev will be created
  + resource "grafana_folder" "Dev" {
      + id    = (known after apply)
      + title = "Dev"
      + uid   = (known after apply)
      + url   = (known after apply)
    }

  # grafana_folder.Production will be created
  + resource "grafana_folder" "Production" {
      + id    = (known after apply)
      + title = "Production"
      + uid   = (known after apply)
      + url   = (known after apply)
    }

  # grafana_folder.Staging will be created
  + resource "grafana_folder" "Staging" {
      + id    = (known after apply)
      + title = "Staging"
      + uid   = (known after apply)
      + url   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Dashboard "9uim8cunk" is in state, but no longer exists in grafana

  with grafana_dashboard.production["prod.json"],
  on dashboards.tf line 1, in resource "grafana_dashboard" "production":
   1: resource "grafana_dashboard" "production" {

"9uim8cunk" will be recreated when you apply

Warning: Dashboard "9uibklgm8cunk" is in state, but no longer exists in grafana

  with grafana_dashboard.staging["stag.json"],
  on dashboards.tf line 9, in resource "grafana_dashboard" "staging":
   9: resource "grafana_dashboard" "staging" {

"9uibklgm8cunk" will be recreated when you apply

Warning: Dashboard "9uim8cafdujnk" is in state, but no longer exists in grafana

  with grafana_dashboard.dev["dev.json"],
  on dashboards.tf line 17, in resource "grafana_dashboard" "dev":
  17: resource "grafana_dashboard" "dev" {

"9uim8cafdujnk" will be recreated when you apply

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```